In [4]:
! pip install pandas
! pip install sqlalchemy
! pip install psycopg2

Collecting pandas
  Downloading pandas-1.2.2-cp39-cp39-manylinux1_x86_64.whl (9.7 MB)
     |████████████████████████████████| 9.7 MB 3.7 MB/s eta 0:00:01
Collecting numpy>=1.16.5
  Downloading numpy-1.20.1-cp39-cp39-manylinux2010_x86_64.whl (15.4 MB)
     |████████████████████████████████| 15.4 MB 1.2 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.7.3 in ./venv/lib/python3.9/site-packages (from pandas) (2.8.1)
Collecting pytz>=2017.3
  Using cached pytz-2021.1-py2.py3-none-any.whl (510 kB)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.20.1 pandas-1.2.2 pytz-2021.1

In [193]:
import pandas as pd
import numpy as np
from random import randrange

In [194]:
from sqlalchemy import create_engine
con = create_engine('postgresql+psycopg2://mteterin:147147@localhost/sber')

In [195]:
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey, Sequence

In [212]:
metadata = MetaData()
department = Table('department', metadata,
             Column('id', Integer, primary_key=True),
             Column("name", String(40))
)
personal = Table('personal', metadata,
             Column('id', Integer, primary_key=True),
             Column("id_head", Integer),
             Column("id_dep", None, ForeignKey('department.id')),
             Column("name", String(40)),
             Column("sal", Integer),
)
metadata.create_all(con)

In [213]:
def select(sql):
    return pd.read_sql(sql,con)

In [214]:
sql_department = '''select * from department'''
sql_personal = '''select * from personal'''

In [215]:
def insert_department(names):
    for name in names:
        con.execute(department.insert().values(name=name))

In [216]:
new_departments = [
    "CRM", "Финансы", "Розница", "Безопасность", "ДКК",
    "Маркетинг", "CIB", "Кредитования", "SIR", "Финансов",
    "Управление данными", "SberDigitalAuto", 
    "Корпоративной Архитектуры", "ДИТ"
]

In [217]:
insert_department(new_departments)

In [218]:
select(sql_department)

    id                       name
0    1                        CRM
1    2                    Финансы
2    3                    Розница
3    4               Безопасность
4    5                        ДКК
5    6                  Маркетинг
6    7                        CIB
7    8               Кредитования
8    9                        SIR
9   10                   Финансов
10  11         Управление данными
11  12            SberDigitalAuto
12  13  Корпоративной Архитектуры
13  14                        ДИТ

In [219]:
def insert_personal_head(data):
    con.execute(personal.insert().values(**data))

In [220]:
def generate_data():
    personnel_number = 1
    department_generator = {(department['id'], department['name']) for index, department in select(select_department).iterrows()}
    for department_id, department_name in department_generator:
        number_of_employees_in_department = randrange(1, 100)
        print(f'В отделе №{department_id}-"{department_name}" работает {number_of_employees_in_department} сотрудников')
        for employee_number in range(number_of_employees_in_department):
            if employee_number == 0:
                id_head = personnel_number
                data = {
                    "id_head": id_head,
                    "id_dep": department_id,
                    "name": f"Руководитель {personnel_number}",
                    "sal": randrange(150, 200) * 1000
                }
            else:
                data = {
                    "id_head": id_head,
                    "id_dep": department_id,
                    "name": f"Сотрудник {personnel_number}",
                    "sal": randrange(10, 200) * 1000
                }
            insert_personal_head(data)
            personnel_number += 1

In [221]:
generate_data()

В отделе №3-"Розница" работает 72 сотрудников
В отделе №12-"SberDigitalAuto" работает 38 сотрудников
В отделе №1-"CRM" работает 87 сотрудников
В отделе №8-"Кредитования" работает 51 сотрудников
В отделе №9-"SIR" работает 66 сотрудников
В отделе №11-"Управление данными" работает 5 сотрудников
В отделе №14-"ДИТ" работает 64 сотрудников
В отделе №4-"Безопасность" работает 1 сотрудников
В отделе №2-"Финансы" работает 45 сотрудников
В отделе №13-"Корпоративной Архитектуры" работает 89 сотрудников
В отделе №10-"Финансов" работает 14 сотрудников
В отделе №5-"ДКК" работает 56 сотрудников
В отделе №7-"CIB" работает 6 сотрудников
В отделе №6-"Маркетинг" работает 50 сотрудников

In [222]:
select(sql_personal)

      id  id_head  id_dep            name     sal
0      1        1       3  Руководитель 1  161000
1      2        1       3     Сотрудник 2   92000
2      3        1       3     Сотрудник 3   11000
3      4        1       3     Сотрудник 4  112000
4      5        1       3     Сотрудник 5  194000
..   ...      ...     ...             ...     ...
639  640      595       6   Сотрудник 640   55000
640  641      595       6   Сотрудник 641  179000
641  642      595       6   Сотрудник 642   50000
642  643      595       6   Сотрудник 643   30000
643  644      595       6   Сотрудник 644   99000

[644 rows x 5 columns]

## Task 1
Вывести отдел с наибольшим числом сотрудников;

In [223]:
select('''
    with employee_department_stats as (
        select id_dep, count(name) person_num  
        from personal p 
        group by p.id_dep 
        order by person_num desc 
        limit 1
    )
    select d.id, d.name, p.person_num 
    from employee_department_stats p 
    join department d on d.id = p.id_dep
''')

   id                       name  person_num
0  13  Корпоративной Архитектуры          89

## Task 2
Вывести список сотрудников, получающих заработную плату выше, чем у руководителя;

In [226]:
select('''
    select p2.id, p2.name  from personal p1 
    join personal p2 on p1.id = p2.id_head 
    where p1.sal < p2.sal;
''')

     id           name
0     5    Сотрудник 5
1    21   Сотрудник 21
2    29   Сотрудник 29
3    34   Сотрудник 34
4    38   Сотрудник 38
..  ...            ...
84  609  Сотрудник 609
85  615  Сотрудник 615
86  623  Сотрудник 623
87  626  Сотрудник 626
88  641  Сотрудник 641

[89 rows x 2 columns]